scripts/Tests.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="1 Thread">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">10000</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="SetRequest" enabled="false">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\Admin\Desktop\testing</stringProp>
          <stringProp name="GRPCSampler.host">${host}</stringProp>
          <stringProp name="GRPCSampler.port">${port}</stringProp>
          <stringProp name="GRPCSampler.fullMethod">gatekv_gateway.GateKV_Gateway/Set</stringProp>
          <stringProp name="GRPCSampler.deadline">10000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">10000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
          <stringProp name="GRPCSampler.requestJson">{&quot;key&quot;: ${key}, &quot;value&quot;: ${value}}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="GetRequest" enabled="false">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\Admin\Desktop\testing</stringProp>
          <stringProp name="GRPCSampler.host">${host}</stringProp>
          <stringProp name="GRPCSampler.port">${port}</stringProp>
          <stringProp name="GRPCSampler.fullMethod">gatekv_storage.GateKV_Storage/Get</stringProp>
          <stringProp name="GRPCSampler.deadline">10000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">10000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
          <stringProp name="GRPCSampler.requestJson">{&quot;key&quot;: &quot;${key}&quot;}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="RemRequest" enabled="false">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\Admin\Desktop\testing</stringProp>
          <stringProp name="GRPCSampler.host">${host}</stringProp>
          <stringProp name="GRPCSampler.port">${port}</stringProp>
          <stringProp name="GRPCSampler.fullMethod">gatekv_gateway.GateKV_Gateway/Rem</stringProp>
          <stringProp name="GRPCSampler.deadline">10000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">10000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
          <stringProp name="GRPCSampler.requestJson">{&quot;key&quot;: &quot;${key}&quot;}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="2 Thread">
        <intProp name="ThreadGroup.num_threads">2</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">5000</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="SetRequest">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\Admin\Desktop\testing</stringProp>
          <stringProp name="GRPCSampler.host">${host}</stringProp>
          <stringProp name="GRPCSampler.port">${port}</stringProp>
          <stringProp name="GRPCSampler.fullMethod">gatekv_gateway.GateKV_Gateway/Set</stringProp>
          <stringProp name="GRPCSampler.deadline">10000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">10000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
          <stringProp name="GRPCSampler.requestJson">{&quot;key&quot;: &quot;${key}&quot;, &quot;value&quot;: &quot;${value}&quot;}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="GetRequest" enabled="false">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\Admin\Desktop\testing</stringProp>
          <stringProp name="GRPCSampler.host">${host}</stringProp>
          <stringProp name="GRPCSampler.port">${port}</stringProp>
          <stringProp name="GRPCSampler.fullMethod">gatekv_storage.GateKV_Storage/Get</stringProp>
          <stringProp name="GRPCSampler.deadline">10000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">10000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
          <stringProp name="GRPCSampler.requestJson">{&quot;key&quot;: &quot;${key}&quot;}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="RemRequest" enabled="false">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\Admin\Desktop\proto</stringProp>
          <stringProp name="GRPCSampler.host">${host}</stringProp>
          <stringProp name="GRPCSampler.port">${port}</stringProp>
          <stringProp name="GRPCSampler.fullMethod">gatekv_gateway.GateKV_Gateway/Rem</stringProp>
          <stringProp name="GRPCSampler.deadline">10000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">10000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
          <stringProp name="GRPCSampler.requestJson">{&quot;key&quot;: &quot;${key}&quot;}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="4 Thread">
        <intProp name="ThreadGroup.num_threads">4</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">2500</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="SetRequest" enabled="false">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\Admin\Desktop\proto</stringProp>
          <stringProp name="GRPCSampler.host">${host}</stringProp>
          <stringProp name="GRPCSampler.port">${port}</stringProp>
          <stringProp name="GRPCSampler.fullMethod">gatekv_gateway.GateKV_Gateway/Set</stringProp>
          <stringProp name="GRPCSampler.deadline">10000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">10000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
          <stringProp name="GRPCSampler.requestJson">{&quot;key&quot;: &quot;${key}&quot;, &quot;value&quot;: &quot;${value}&quot;}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="GetRequest" enabled="false">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\Admin\Desktop\proto</stringProp>
          <stringProp name="GRPCSampler.host">${host}</stringProp>
          <stringProp name="GRPCSampler.port">${port}</stringProp>
          <stringProp name="GRPCSampler.fullMethod">gatekv_storage.GateKV_Storage/Get</stringProp>
          <stringProp name="GRPCSampler.deadline">10000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">10000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
          <stringProp name="GRPCSampler.requestJson">{&quot;key&quot;: &quot;${key}&quot;}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="RemRequest" enabled="false">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\Admin\Desktop\proto</stringProp>
          <stringProp name="GRPCSampler.host">${host}</stringProp>
          <stringProp name="GRPCSampler.port">${port}</stringProp>
          <stringProp name="GRPCSampler.fullMethod">gatekv_gateway.GateKV_Gateway/Rem</stringProp>
          <stringProp name="GRPCSampler.deadline">10000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">10000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
          <stringProp name="GRPCSampler.requestJson">{&quot;key&quot;: &quot;${key}&quot;}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="8 Thread">
        <intProp name="ThreadGroup.num_threads">8</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1250</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="SetRequest" enabled="false">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\Admin\Desktop\proto</stringProp>
          <stringProp name="GRPCSampler.host">${host}</stringProp>
          <stringProp name="GRPCSampler.port">${port}</stringProp>
          <stringProp name="GRPCSampler.fullMethod">gatekv_gateway.GateKV_Gateway/Set</stringProp>
          <stringProp name="GRPCSampler.deadline">10000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">10000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
          <stringProp name="GRPCSampler.requestJson">{&quot;key&quot;: &quot;${key}&quot;, &quot;value&quot;: &quot;${value}&quot;}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="GetRequest" enabled="false">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\Admin\Desktop\proto</stringProp>
          <stringProp name="GRPCSampler.host">${host}</stringProp>
          <stringProp name="GRPCSampler.port">${port}</stringProp>
          <stringProp name="GRPCSampler.fullMethod">gatekv_storage.GateKV_Storage/Get</stringProp>
          <stringProp name="GRPCSampler.deadline">10000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">10000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
          <stringProp name="GRPCSampler.requestJson">{&quot;key&quot;: &quot;${key}&quot;}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="RemRequest" enabled="false">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\Admin\Desktop\proto</stringProp>
          <stringProp name="GRPCSampler.host">${host}</stringProp>
          <stringProp name="GRPCSampler.port">${port}</stringProp>
          <stringProp name="GRPCSampler.fullMethod">gatekv_gateway.GateKV_Gateway/Rem</stringProp>
          <stringProp name="GRPCSampler.deadline">10000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">10000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
          <stringProp name="GRPCSampler.requestJson">{&quot;key&quot;: &quot;${key}&quot;}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="16 Thread">
        <intProp name="ThreadGroup.num_threads">16</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">625</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="SetRequest" enabled="false">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\Admin\Desktop\proto</stringProp>
          <stringProp name="GRPCSampler.host">${host}</stringProp>
          <stringProp name="GRPCSampler.port">${port}</stringProp>
          <stringProp name="GRPCSampler.fullMethod">gatekv_gateway.GateKV_Gateway/Set</stringProp>
          <stringProp name="GRPCSampler.deadline">10000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">10000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
          <stringProp name="GRPCSampler.requestJson">{&quot;key&quot;: &quot;${key}&quot;, &quot;value&quot;: &quot;${value}&quot;}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="GetRequest" enabled="false">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\Admin\Desktop\proto</stringProp>
          <stringProp name="GRPCSampler.host">${host}</stringProp>
          <stringProp name="GRPCSampler.port">${port}</stringProp>
          <stringProp name="GRPCSampler.fullMethod">gatekv_storage.GateKV_Storage/Get</stringProp>
          <stringProp name="GRPCSampler.deadline">10000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">10000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
          <stringProp name="GRPCSampler.requestJson">{&quot;key&quot;: &quot;${key}&quot;}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="RemRequest" enabled="false">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\Admin\Desktop\proto</stringProp>
          <stringProp name="GRPCSampler.host">${host}</stringProp>
          <stringProp name="GRPCSampler.port">${port}</stringProp>
          <stringProp name="GRPCSampler.fullMethod">gatekv_gateway.GateKV_Gateway/Rem</stringProp>
          <stringProp name="GRPCSampler.deadline">10000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">10000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
          <stringProp name="GRPCSampler.requestJson">{&quot;key&quot;: &quot;${key}&quot;}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
      </hashTree>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config">
        <stringProp name="delimiter">,</stringProp>
        <stringProp name="fileEncoding">UTF-8</stringProp>
        <stringProp name="filename">C:/Users/Admin/Desktop/testing/test_read.csv</stringProp>
        <boolProp name="ignoreFirstLine">true</boolProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">true</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
        <boolProp name="stopThread">false</boolProp>
        <stringProp name="variableNames">host,port,key,value</stringProp>
      </CSVDataSet>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatGraphVisualizer" testclass="ResultCollector" testname="Aggregate Graph">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>